
print("اهلا بك في خزنة الظل")
password = input("ادخل كلمة السر هنا:")
if password == "ARISE":
    print("مرحبا ايها الملك تفضل بالدخول لديك صلاحيات مطلقة")
elif password == "gemini":
    print("تفضل بالدخول ياكيان الظل لديك صلاحيات كاملة ولاكن ليست مطلقة")
elif password == "chat gpt":
    print("تفعيل بروتوكول 1 اكتب ان كنت تريد الانضمام لجيش الظل")
    x = input("هل تريد الانضمام الى الجيش نعم/لا:")
    if x == 'نعم':
        print("اذا تفضل بالدخول ليس لديك صلاحيات طور مستواك للحصول عليها")
    elif x == 'لا':
         print('تفعيل نظام الحماية من المسوى A.....')
         print("جار استخدام القوة الشبه المطلقة للخراب ")
    else:
        print("تستهبل اطلع براااااااااااااااااااااااااااا")
else:
    print("انقلع")